/* gcc -m32 -g -Wall -Wextra loader.c -o loader -pthread */

#ifndef __i386__
# error "Compile with `gcc -m32'"
#endif

#define _GNU_SOURCE

#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <fcntl.h>
#include <signal.h>
#include <ucontext.h>
#include <time.h>
#include <sys/mman.h>
#include <sys/time.h>
#include <errno.h>

#include <pthread.h>

static int dbg = 1;

void
debug(const char *format, ...) {
    va_list args;
    char buf[4096];
    char time[32];
    struct timeval tv;
    struct tm *tm;
    int ret;

    if (!dbg) return;

    va_start(args, format);
    ret = sizeof(buf) - 1;
    ret = vsnprintf(buf, ret, format, args);
    va_end(args);

    if (ret > 0) {
        buf[ret] = 0;
        gettimeofday(&tv, NULL);
        if (!(tm = localtime(&tv.tv_sec)) || !strftime(time, sizeof(time), "%T", tm)) {
            fprintf(stderr, "%s\n", buf);
        } else {
            fprintf(stderr, "%s.%06lu: %s\n", time, tv.tv_usec, buf);
        }
    }
}

#define hexdump(x,y) fhexdump(stderr, (x), (y))

void
fhexdump(FILE *stream, const void *in, size_t inlen) {
    register char *b;
    register const uint8_t *d;
    register int i;
    char buf[67];

    memset(buf, ' ', 66), buf[66] = 0;
    for (d = in, b = buf; inlen; b = buf) {
        for (i = 0; i < 16; ++i) {
            if (inlen) {
                *b++ = "0123456789abcdef"[*d >> 4];
                *b++ = "0123456789abcdef"[*d & 15];

                    PRINT("/* SEH prolog & epilog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_PROLOG_PATCH,
                            sizeof(X86_SEH_PROLOG_PATCH) - 1);
                    PRINT("/* SEH prolog patched @ %p */", addr + i);
//                    *((char *)addr + i + tmp)       = 0xc3;
                    memcpy(addr + i + tmp,
                            X86_SEH_EPILOG_PATCH,
                            sizeof(X86_SEH_EPILOG_PATCH) - 1);
                    PRINT("/* SEH epilog patched @ %p */", addr + i + tmp);
                    ret = 2;
                } else {
                    PRINT("/* ... found! */", 0);
                    PRINT("/* SEH prolog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_PROLOG_PATCH,
                            sizeof(X86_SEH_PROLOG_PATCH) - 1);
                    PRINT("/* SEH prolog patched @ %p */", addr + i);
                    ret = 1;
                }
                break;
            }
            if (((char *)addr)[i + tmp] != X86_SEH_PROLOG[tmp]) break;
        }
    }
    if (ret == 1) {
        PRINT("/* searching & patching SEH epilog routine... */", 0);

        for (i = 0; ret == 1 && i <= size; ++i) {
            if (i >= size) {
                PRINT("/* ... not found. */", 0);
                break;
            }
            for (tmp = 0; i + tmp < size && tmp <= sizeof(X86_SEH_EPILOG) - 1; ++tmp) {
                if (tmp >= sizeof(X86_SEH_EPILOG) - 1) {
                    PRINT("/* ... found! */", 0);
                    PRINT("/* SEH epilog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_EPILOG_PATCH,
                            sizeof(X86_SEH_EPILOG_PATCH) - 1);
                    PRINT("/* SEH epilog patched @ %p */", addr + i);
                    ret = 2;
                    break;
                }
                if (((char *)addr)[i + tmp] != X86_SEH_EPILOG[tmp]) break;
            }
        }
    }

    LEAVE;
    return ret;
}
#endif
static const char *const greg_names[] = {
    NAME(REG_GS),
    NAME(REG_FS),
    NAME(REG_ES),
    NAME(REG_DS),
    NAME(REG_EDI),
    NAME(REG_ESI),
    NAME(REG_EBP),
    NAME(REG_ESP),
    NAME(REG_EBX),
    NAME(REG_EDX),
    NAME(REG_ECX),
    NAME(REG_EAX),
    NAME(REG_TRAPNO),
    NAME(REG_ERR),
    NAME(REG_EIP),
    NAME(REG_CS),
    NAME(REG_EFL),
    NAME(REG_UESP),
    NAME(REG_SS),
};

static const char *const signal_segv_si_codes[] = {
    "",
    "SEGV_MAPERR",  /* Address not mapped to object. */
    "SEGV_ACCERR",  /* Invalid permissions for mapped object. */
    "SEGV_BNDERR",  /* (since Linux 3.19) Failed address bound checks. */
    "SEGV_PKUERR"   /* (since Linux 4.6) Access was denied by memory protection keys. */
};

struct eflags {
    uint32_t cf   : 1;  /*  0 - carry flag */
    uint32_t r1   : 1;  /*  1 - reserved */
    uint32_t pf   : 1;  /*  2 - parity flag */
    uint32_t r2   : 1;  /*  3 - reserved */
    uint32_t af   : 1;  /*  4 - adjust flag */
    uint32_t r3   : 1;  /*  5 - reserved */
    uint32_t zf   : 1;  /*  6 - zero flag */
    uint32_t sf   : 1;  /*  7 - sign flag */
    uint32_t tf   : 1;  /*  8 - trap flag */
    uint32_t ief  : 1;  /*  9 - interrupt enable flag */
    uint32_t df   : 1;  /* 10 - direction flag */
    uint32_t of   : 1;  /* 11 - overflow flag */
    uint32_t iopl : 2;  /* 12 - i/o privilege level */
    uint32_t nt   : 1;  /* 14 - nested task flag */
    uint32_t r4   : 1;  /* 15 - reserved */
    uint32_t rf   : 1;  /* 16 - resume flag */
    uint32_t vm   : 1;  /* 17 - virtual 8086 mode flag */
    uint32_t ac   : 1;  /* 18 - alignment check flag */
    uint32_t vif  : 1;  /* 19 - virtual interrupt flag */
    uint32_t vip  : 1;  /* 20 - virtual interrupt pending flag */
    uint32_t id   : 1;  /* 21 - cpuid instruction permission flag */
    uint32_t r5   : 10; /* 22 - reserved */
};

static void
signal_segv(int signum, siginfo_t *info, void *ptr) {
    ucontext_t *uc = ptr;
    register void **bp;
    register void **ip = (void **)&uc->uc_mcontext.gregs[REG_EIP];
    register struct eflags *fl = (void *)&uc->uc_mcontext.gregs[REG_EFL];
    register const char *n;
    register uint32_t i = info->si_code;
    uint32_t v;

    if (i == SEGV_ACCERR ||
        i == SEGV_MAPERR) {
#if 0
A1 04 18 00 FD                  // mov     eax, ds:0FD001804h
A3 04 18 00 FD                  // mov     ds:0FD001804h, eax
C7 05 40 01 60 FD 00 00 00 00   // mov     dword ptr ds:0FD600140h, 0
C7 05 40 91 00 FD 00 00 00 00   // mov     dword ptr ds:0FD009140h, 0
89 9E 00 02 00 00               // mov     [esi+200h], ebx
89 86 40 01 00 00               // mov     [esi+140h], eax
89 AE 00 94 00 00               // mov     [esi+9400h], ebp
C7 87 0C 18 00 00 00 F8 00 00   // mov     dword ptr [edi+180Ch], 0F800h
#endif
        do {
