/* gcc -m32 -g -Wall -Wextra loader.c -o loader -pthread */

#ifndef __i386__
# error "Compile with `gcc -m32'"
#endif

#define _GNU_SOURCE

#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <fcntl.h>
#include <signal.h>
#include <ucontext.h>
#include <time.h>
#include <sys/mman.h>
#include <sys/time.h>
#include <errno.h>

#include <pthread.h>

static int dbg = 1;

void
debug(const char *format, ...) {
    va_list args;
    char buf[4096];
    char time[32];
    struct timeval tv;
    struct tm *tm;
    int ret;

    if (!dbg) return;

    va_start(args, format);
    ret = sizeof(buf) - 1;
    ret = vsnprintf(buf, ret, format, args);
    va_end(args);

    if (ret > 0) {
        buf[ret] = 0;
        gettimeofday(&tv, NULL);
        if (!(tm = localtime(&tv.tv_sec)) || !strftime(time, sizeof(time), "%T", tm)) {
            fprintf(stderr, "%s\n", buf);
        } else {
            fprintf(stderr, "%s.%06lu: %s\n", time, tv.tv_usec, buf);
        }
    }
}

#define hexdump(x,y) fhexdump(stderr, (x), (y))

void
fhexdump(FILE *stream, const void *data, size_t len) {
    char buf[66];
    char *b;
    const unsigned char *d = data;
    int i;

    for (i = 0; i < (int)sizeof(buf); ++i) buf[i] = ' ';

    for (b = buf; len; b = buf) {
        for (i = 0; i < 16; ++i) {
            if (len) {
                *b++ = "0123456789abcdef"[*d >> 4];
                *b++ = "0123456789abcdef"[*d & 0xf];
                ++b;
                buf[50 + i] = (*d >= ' ' && *d < 0x7f) ? *d : '.';
                ++d, --len;
            } else {
                *b++ = ' ';
                *b++ = ' ';
                *b++ = ' ';
                buf[50 + i] = 0;
            }
        }
        fprintf(stream, "%.*s\n", (int)sizeof(buf), buf);
    }
}

#define PACKED              __attribute__((__packed__))

#define PAGESIZE            0x1000
#define PAGEMASK            (PAGESIZE - 1)

#define XBE_MAGIC           "XBEH"
#define XBE_BASE_ADDR       0x10000

#define XBE_XOR_EP_DEBUG    0x94859d4b      /* entry point (Debug) */
#define XBE_XOR_EP_RETAIL   0xa8fc57ab      /* entry point (Retail) */
#define XBE_XOR_EP_CHIHIRO  0x40b5c16e      /* entry point (Chihiro) */
#define XBE_XOR_KT_DEBUG    0xefb1f152      /* kernel thunk (Debug) */
#define XBE_XOR_KT_RETAIL   0x5b6d40b6      /* kernel thunk (Retail) */
#define XBE_XOR_KT_CHIHIRO  0x2290059d      /* kernel thunk (Chihiro) */

typedef struct {
    uint32_t dwMagic;                       /* 0x0000 - magic number [should be "XBEH"] */
    uint8_t  pbDigitalSignature[256];       /* 0x0004 - digital signature */
    uint32_t dwBaseAddr;                    /* 0x0104 - base address */
    uint32_t dwSizeofHeaders;               /* 0x0108 - size of headers */
    uint32_t dwSizeofImage;                 /* 0x010c - size of image */
    uint32_t dwSizeofImageHeader;           /* 0x0110 - size of image header */
    uint32_t dwTimeDate;                    /* 0x0114 - timedate stamp */
    uint32_t dwCertificateAddr;             /* 0x0118 - certificate address */
    uint32_t dwSections;                    /* 0x011c - number of sections */
    uint32_t dwSectionHeadersAddr;          /* 0x0120 - section headers address */

    struct {                                /* 0x0124 - initialization flags */
        uint32_t bMountUtilityDrive   : 1;  /* 0x0124 - mount utility drive flag */
        uint32_t bFormatUtilityDrive  : 1;  /* 0x0124 - format utility drive flag */
        uint32_t bLimit64MB           : 1;  /* 0x0124 - limit development kit run time memory to 64mb flag */
        uint32_t bDontSetupHarddisk   : 1;  /* 0x0124 - don't setup hard disk flag */
        uint32_t Unused1              : 4;  /* 0x0124 - unused */
        uint32_t Unused2              : 8;  /* 0x0125 - unused */
        uint32_t Unused3              : 8;  /* 0x0126 - unused */
        uint32_t Unused4              : 8;  /* 0x0127 - unused */
    } PACKED dwInitFlags;

    uint32_t dwEntryAddr;                   /* 0x0128 - entry point address */
    uint32_t dwTLSAddr;                     /* 0x012c - thread local storage directory address */
    uint32_t dwPeStackCommit;               /* 0x0130 - size of stack commit */
    uint32_t dwPeHeapReserve;               /* 0x0134 - size of heap reserve */
    uint32_t dwPeHeapCommit;                /* 0x0138 - size of heap commit */
    uint32_t dwPeBaseAddr;                  /* 0x013c - original base address */
    uint32_t dwPeSizeofImage;               /* 0x0140 - size of original image */
    uint32_t dwPeChecksum;                  /* 0x0144 - original checksum */
    uint32_t dwPeTimeDate;                  /* 0x0148 - original timedate stamp */
    uint32_t dwDebugPathnameAddr;           /* 0x014c - debug pathname address */
    uint32_t dwDebugFilenameAddr;           /* 0x0150 - debug filename address */
    uint32_t dwDebugUnicodeFilenameAddr;    /* 0x0154 - debug unicode filename address */
    uint32_t dwKernelImageThunkAddr;        /* 0x0158 - kernel image thunk address */
    uint32_t dwNonKernelImportDirAddr;      /* 0x015c - non kernel import directory address */
    uint32_t dwLibraryVersions;             /* 0x0160 - number of library versions */
    uint32_t dwLibraryVersionsAddr;         /* 0x0164 - library versions address */
    uint32_t dwKernelLibraryVersionAddr;    /* 0x0168 - kernel library version address */
    uint32_t dwXAPILibraryVersionAddr;      /* 0x016c - xapi library version address */
    uint32_t dwLogoBitmapAddr;              /* 0x0170 - logo bitmap address */
    uint32_t dwSizeofLogoBitmap;            /* 0x0174 - logo bitmap size */
} PACKED XbeHeader;

typedef struct {
    struct {                                /* 0x0000 - section flags */
        uint32_t bWritable        : 1;      /* 0x0000 - writable flag */
        uint32_t bPreload         : 1;      /* 0x0000 - preload flag */
        uint32_t bExecutable      : 1;      /* 0x0000 - executable flag */
        uint32_t bInsertedFile    : 1;      /* 0x0000 - inserted file flag */
        uint32_t bHeadPageRO      : 1;      /* 0x0000 - head page read only flag */
        uint32_t bTailPageRO      : 1;      /* 0x0000 - tail page read only flag */
        uint32_t Unused1          : 1;      /* 0x0000 - unused */
        uint32_t Unused2          : 1;      /* 0x0000 - unused */
        uint32_t Unused3          : 8;      /* 0x0001 - unused */
        uint32_t Unused4          : 8;      /* 0x0002 - unused */
        uint32_t Unused5          : 8;      /* 0x0003 - unused */
    } PACKED dwFlags;

    uint32_t dwVirtualAddr;                 /* 0x0004 - virtual address */
    uint32_t dwVirtualSize;                 /* 0x0008 - virtual size */
    uint32_t dwRawAddr;                     /* 0x000c - file offset to raw data */
    uint32_t dwSizeofRaw;                   /* 0x0010 - size of raw data */
    uint32_t dwSectionNameAddr;             /* 0x0014 - section name addr */
    uint32_t dwSectionRefCount;             /* 0x0018 - section reference count */
    uint32_t dwHeadSharedRefCountAddr;      /* 0x001c - head shared page reference count address */
    uint32_t dwTailSharedRefCountAddr;      /* 0x0020 - tail shared page reference count address */
    uint8_t  bzSectionDigest[20];           /* 0x0024 - section digest */
} PACKED XbeSectionHeader;

typedef struct {
    uint32_t dwDataStartAddr;               /* 0x0000 - raw start address */
    uint32_t dwDataEndAddr;                 /* 0x0004 - raw end address */
    uint32_t dwTLSIndexAddr;                /* 0x0008 - tls index address */
    uint32_t dwTLSCallbackAddr;             /* 0x000c - tls callback address */
    uint32_t dwSizeofZeroFill;              /* 0x0010 - size of zero fill */
    uint32_t dwCharacteristics;             /* 0x0014 - characteristics */
} PACKED XbeTLS;

#include "xboxkrnl.c"
#if 0
#define X86_SEH_PROLOG \
        "\x68\xb0\x6a\x0f\x00\x64\xa1\x00\x00\x00\x00\x50\x8b\x44\x24\x10" \
        "\x89\x6c\x24\x10\x8d\x6c\x24\x10\x2b\xe0\x53\x56\x57\x8b\x45\xf8" \
        "\x89\x65\xe8\x50\x8b\x45\xfc\xc7\x45\xfc\xff\xff\xff\xff\x89\x45" \
        "\xf8\x8d\x45\xf0\x64\xa3\x00\x00\x00\x00\xc3"
#define X86_SEH_PROLOG_PATCH \
        "\x68\xb0\x6a\x0f\x00\x90\x90\x90\x90\x90\x90\x50\x8b\x44\x24\x10" \
        "\x89\x6c\x24\x10\x8d\x6c\x24\x10\x2b\xe0\x53\x56\x57\x8b\x45\xf8" \
        "\x89\x65\xe8\x50\x8b\x45\xfc\xc7\x45\xfc\xff\xff\xff\xff\x89\x45" \
        "\xf8\x90\x90\x90\x90\x90\x90\x90\x90\x90\xc3"
#define X86_SEH_EPILOG \
        "\x8b\x4d\xf0\x64\x89\x0d\x00\x00\x00\x00\x59\x5f\x5e\x5b\xc9\x51" \
        "\xc3"
#define X86_SEH_EPILOG_PATCH \
        "\x90\x90\x90\x90\x90\x90\x90\x90\x90\x90\x59\x5f\x5e\x5b\xc9\x51" \
        "\xc3"

int
xboxkrnl_patch_seh(void *addr, size_t size) {
    size_t i;
    size_t tmp;
    int ret = 0;
    ENTER;

    PRINT("/* searching & patching SEH prolog & epilog routines... */", 0);

    for (i = 0; !ret && i <= size; ++i) {
        if (i >= size) {
            PRINT("/* ... not found. */", 0);
            break;
        }
        for (tmp = 0; i + tmp < size && tmp <= sizeof(X86_SEH_PROLOG) - 1; ++tmp) {
            if (tmp >= sizeof(X86_SEH_PROLOG) - 1) {
                if (!memcmp(addr + i + tmp,
                        X86_SEH_EPILOG,
                        sizeof(X86_SEH_EPILOG) - 1)) {
                    PRINT("/* ... found! */", 0);
                    PRINT("/* SEH prolog & epilog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_PROLOG_PATCH,
                            sizeof(X86_SEH_PROLOG_PATCH) - 1);
                    PRINT("/* SEH prolog patched @ %p */", addr + i);
//                    *((char *)addr + i + tmp)       = 0xc3;
                    memcpy(addr + i + tmp,
                            X86_SEH_EPILOG_PATCH,
                            sizeof(X86_SEH_EPILOG_PATCH) - 1);
                    PRINT("/* SEH epilog patched @ %p */", addr + i + tmp);
                    ret = 2;
                } else {
                    PRINT("/* ... found! */", 0);
                    PRINT("/* SEH prolog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_PROLOG_PATCH,
                            sizeof(X86_SEH_PROLOG_PATCH) - 1);
                    PRINT("/* SEH prolog patched @ %p */", addr + i);
                    ret = 1;
                }
                break;
            }
            if (((char *)addr)[i + tmp] != X86_SEH_PROLOG[tmp]) break;
        }
    }
    if (ret == 1) {
        PRINT("/* searching & patching SEH epilog routine... */", 0);

        for (i = 0; ret == 1 && i <= size; ++i) {
            if (i >= size) {
                PRINT("/* ... not found. */", 0);
                break;
            }
            for (tmp = 0; i + tmp < size && tmp <= sizeof(X86_SEH_EPILOG) - 1; ++tmp) {
                if (tmp >= sizeof(X86_SEH_EPILOG) - 1) {
                    PRINT("/* ... found! */", 0);
                    PRINT("/* SEH epilog @ %p */", addr + i);
//                    *((char *)addr + i)             = 0xc3;
                    memcpy(addr + i,
                            X86_SEH_EPILOG_PATCH,
                            sizeof(X86_SEH_EPILOG_PATCH) - 1);
                    PRINT("/* SEH epilog patched @ %p */", addr + i);
                    ret = 2;
                    break;
                }
                if (((char *)addr)[i + tmp] != X86_SEH_EPILOG[tmp]) break;
            }
        }
    }

    LEAVE;
    return ret;
}
#endif
static const char *const greg_names[] = {
    NAME(REG_GS),
    NAME(REG_FS),
    NAME(REG_ES),
    NAME(REG_DS),
    NAME(REG_EDI),
    NAME(REG_ESI),
    NAME(REG_EBP),
    NAME(REG_ESP),
    NAME(REG_EBX),
    NAME(REG_EDX),
    NAME(REG_ECX),
    NAME(REG_EAX),
    NAME(REG_TRAPNO),
    NAME(REG_ERR),
    NAME(REG_EIP),
    NAME(REG_CS),
    NAME(REG_EFL),
    NAME(REG_UESP),
    NAME(REG_SS),
};

static const char *const signal_segv_si_codes[] = {
    "",
    "SEGV_MAPERR",  /* Address not mapped to object. */
    "SEGV_ACCERR",  /* Invalid permissions for mapped object. */
    "SEGV_BNDERR",  /* (since Linux 3.19) Failed address bound checks. */
    "SEGV_PKUERR"   /* (since Linux 4.6) Access was denied by memory protection keys. */
};

struct eflags {
    uint32_t cf   : 1;  /*  0 - carry flag */
    uint32_t r1   : 1;  /*  1 - reserved */
    uint32_t pf   : 1;  /*  2 - parity flag */
    uint32_t r2   : 1;  /*  3 - reserved */
    uint32_t af   : 1;  /*  4 - adjust flag */
    uint32_t r3   : 1;  /*  5 - reserved */
    uint32_t zf   : 1;  /*  6 - zero flag */
    uint32_t sf   : 1;  /*  7 - sign flag */
    uint32_t tf   : 1;  /*  8 - trap flag */
    uint32_t ief  : 1;  /*  9 - interrupt enable flag */
    uint32_t df   : 1;  /* 10 - direction flag */
    uint32_t of   : 1;  /* 11 - overflow flag */
    uint32_t iopl : 2;  /* 12 - i/o privilege level */
    uint32_t nt   : 1;  /* 14 - nested task flag */
    uint32_t r4   : 1;  /* 15 - reserved */
    uint32_t rf   : 1;  /* 16 - resume flag */
    uint32_t vm   : 1;  /* 17 - virtual 8086 mode flag */
    uint32_t ac   : 1;  /* 18 - alignment check flag */
    uint32_t vif  : 1;  /* 19 - virtual interrupt flag */
    uint32_t vip  : 1;  /* 20 - virtual interrupt pending flag */
    uint32_t id   : 1;  /* 21 - cpuid instruction permission flag */
    uint32_t r5   : 10; /* 22 - reserved */
};

static void
signal_segv(int signum, siginfo_t *info, void *ptr) {
    ucontext_t *uc = ptr;
    register void **bp;
    register void **ip = (void **)&uc->uc_mcontext.gregs[REG_EIP];
    register struct eflags *fl;
    register const char *n;
    register uint32_t i = info->si_code;
    uint32_t v;

    if (i == SEGV_ACCERR) {
#if 0
A1 04 18 00 FD                  // mov     eax, ds:0FD001804h
A3 04 18 00 FD                  // mov     ds:0FD001804h, eax
C7 05 40 01 60 FD 00 00 00 00   // mov     dword ptr ds:0FD600140h, 0
C7 05 40 91 00 FD 00 00 00 00   // mov     dword ptr ds:0FD009140h, 0
89 9E 00 02 00 00               // mov     [esi+200h], ebx
89 86 40 01 00 00               // mov     [esi+140h], eax
89 AE 00 94 00 00               // mov     [esi+9400h], ebp
C7 87 0C 18 00 00 00 F8 00 00   // mov     dword ptr [edi+180Ch], 0F800h
#endif
        do {
            i = (typeof(i))info->si_addr;
