/*
 *  xexec - XBE x86 direct execution LLE & XBOX kernel POSIX translation HLE
 *
 *  Copyright (c) 2012 Michael Saga. All rights reserved.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License
 *  as published by the Free Software Foundation; either version 2
 *  of the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along
 *  with this program; if not, write to the Free Software Foundation, Inc.,
 *  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

#ifndef __i386__
# error "Compile with `gcc -m32'"
#endif

#define _GNU_SOURCE

#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <fcntl.h>
#include <signal.h>
#include <ucontext.h>
#include <time.h>
#include <sys/mman.h>
#include <sys/time.h>
#include <errno.h>

#include <pthread.h>

static int dbg = 1;

int xboxkrnl_tsc_on(void);
int xboxkrnl_tsc_off(void);
void xboxkrnl_clock_local(struct timeval *tv);
void xboxkrnl_clock_wall(struct timespec *tp);

void
debug(const char *format, ...) {
    va_list args;
    char buf[4096];
    char time[32];
    struct timeval tv;
    struct tm *tm;
    int ret;

    if (!dbg) return;

    va_start(args, format);
    ret = sizeof(buf) - 1;
    ret = vsnprintf(buf, ret, format, args);
    va_end(args);

    if (ret > 0) {
        buf[ret] = 0;
        xboxkrnl_clock_local(&tv);
        if (!(tm = localtime(&tv.tv_sec)) || !strftime(time, sizeof(time), "%T", tm)) {
            fprintf(stderr, "%s\n", buf);
        } else {
            fprintf(stderr, "%s.%06lu: %s\n", time, tv.tv_usec, buf);
        }
    }
}

#define hexdump(x,y) fhexdump(stderr, (x), (y))

void
fhexdump(FILE *stream, const void *in, size_t inlen) {
    register char *b;
    register const uint8_t *d;
    register int i;
    char buf[67];

    memset(buf, ' ', 66), buf[66] = 0;
    for (d = in, b = buf; inlen; b = buf) {
        for (i = 0; i < 16; ++i) {
            if (inlen) {
                *b++ = "0123456789abcdef"[*d >> 4];
                *b++ = "0123456789abcdef"[*d & 15];
                ++b;
                buf[50 + i] = (*d >= ' ' && *d < 0x7f) ? *d : '.';
                ++d;
                --inlen;
            } else {
                *b++ = ' ';
                *b++ = ' ';
                ++b;
                buf[50 + i] = 0;
            }
        }
        fprintf(stream, "%.*s\n", 66, buf);
    }
}

#define PACKED              __attribute__((__packed__))

#define PAGESIZE            0x1000
#define PAGEMASK            (PAGESIZE - 1)

#include "sw/xbe.h"
int ohci_write(uint32_t addr, const void *val, size_t sz);
int ohci_read(uint32_t addr, void *val, size_t sz);
int apu_write(uint32_t addr, const void *val, size_t sz);
int apu_read(uint32_t addr, void *val, size_t sz);
int aci_write(uint32_t addr, const void *val, size_t sz);
int aci_read(uint32_t addr, void *val, size_t sz);
void nv2a_pfifo_puller(register void *p);
int nv2a_init(void);
void nv2a_irq_restore(register int mask);
int nv2a_irq(void);
void nv2a_framebuffer_set(uint32_t addr);
int nv2a_write(uint32_t addr, const void *val, size_t sz);
int nv2a_read(uint32_t addr, void *val, size_t sz);
#include "xboxkrnl.c"
#include "sw/xbe.c"
#include "sw/gloffscreen.c"
#include "hw/usb/ohci.c"
#include "hw/apu/apu.c"
#include "hw/aci/aci.c"
#include "hw/gpu/nv2a.c"

static const char *const x86_greg_name[] = {
    [REG_GS]     = " gs",
    [REG_FS]     = " fs",
    [REG_ES]     = " es",
    [REG_DS]     = " ds",
    [REG_EDI]    = "edi",
    [REG_ESI]    = "esi",
    [REG_EBP]    = "ebp",
    [REG_ESP]    = "esp",
    [REG_EBX]    = "ebx",
    [REG_EDX]    = "edx",
    [REG_ECX]    = "ecx",
    [REG_EAX]    = "eax",
    [REG_TRAPNO] = "tno",
    [REG_ERR]    = "err",
    [REG_EIP]    = "eip",
    [REG_CS]     = " cs",
    [REG_EFL]    = "efl",
    [REG_UESP]   = "esp",
    [REG_SS]     = " ss",
};

typedef struct {
    uint32_t cf   : 1;  /*  0 - carry flag */
    uint32_t r1   : 1;  /*  1 - reserved */
    uint32_t pf   : 1;  /*  2 - parity flag */
    uint32_t r2   : 1;  /*  3 - reserved */
    uint32_t af   : 1;  /*  4 - adjust flag */
    uint32_t r3   : 1;  /*  5 - reserved */
    uint32_t zf   : 1;  /*  6 - zero flag */
    uint32_t sf   : 1;  /*  7 - sign flag */
    uint32_t tf   : 1;  /*  8 - trap flag */
    uint32_t ief  : 1;  /*  9 - interrupt enable flag */
    uint32_t df   : 1;  /* 10 - direction flag */
    uint32_t of   : 1;  /* 11 - overflow flag */
    uint32_t iopl : 2;  /* 12 - i/o privilege level */
    uint32_t nt   : 1;  /* 14 - nested task flag */
    uint32_t r4   : 1;  /* 15 - reserved */
    uint32_t rf   : 1;  /* 16 - resume flag */
    uint32_t vm   : 1;  /* 17 - virtual 8086 mode flag */
    uint32_t ac   : 1;  /* 18 - alignment check flag */
    uint32_t vif  : 1;  /* 19 - virtual interrupt flag */
    uint32_t vip  : 1;  /* 20 - virtual interrupt pending flag */
    uint32_t id   : 1;  /* 21 - cpuid instruction permission flag */
    uint32_t r5   : 10; /* 22 - reserved */
} x86_eflags;

static const char *const x86_eflags_name[] = {
    NAMEB(0,  carry),
    NAMEB(2,  parity),
    NAMEB(4,  adjust),
    NAMEB(6,  zero),
    NAMEB(7,  sign),
    NAMEB(8,  trap),
    NAMEB(9,  irq_enable),
    NAMEB(10, direction),
    NAMEB(11, overflow),
    NAMEB(14, nested),
    NAMEB(16, resume),
    NAMEB(17, vm86),
    NAMEB(18, align),
    NAMEB(19, virq),
    NAMEB(20, virq_pending),
    NAMEB(21, cpuid),
};

static const char *const signal_segv_si_code_name[] = {
    NULL,
    "SEGV_MAPERR",      /* Address not mapped to object. */
    "SEGV_ACCERR",      /* Invalid permissions for mapped object. */
    "SEGV_BNDERR",      /* (since Linux 3.19) Failed address bound checks. */
    "SEGV_PKUERR",      /* (since Linux 4.6) Access was denied by memory protection keys. */
};

static void
signal_segv(int signum, siginfo_t *info, void *ptr) {
    ucontext_t *uc = ptr;
    register void **bp;
