
#include "nv2a.h"

#define DEBUG_NV2A 2

#ifdef DEBUG_NV2A
# if DEBUG_NV2A == 1
#  define PRINT_NV2A        PRINT
# elif DEBUG_NV2A == 2
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# else
#  define ENTER_NV2A        ENTER
#  define LEAVE_NV2A        LEAVE
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# endif
#endif
#ifndef ENTER_NV2A
# define ENTER_NV2A
#endif
#ifndef LEAVE_NV2A
# define LEAVE_NV2A
#endif
#ifndef PRINT_NV2A
# define PRINT_NV2A(...)
#endif
#ifndef VARDUMP_NV2A
# define VARDUMP_NV2A(...)
#endif
#ifndef VARDUMP2_NV2A
# define VARDUMP2_NV2A(...)
#endif
#ifndef VARDUMP3_NV2A
# define VARDUMP3_NV2A(...)
#endif
#ifndef VARDUMP4_NV2A
# define VARDUMP4_NV2A(...)
#endif

static void *               xboxkrnl_gpuinstmem = NULL;
static size_t               xboxkrnl_gpuinstsz = 0;

static uint32_t             nv2a_dma[16] = { };     /* base: 0x80000000 */

typedef struct {
    union {
        uint32_t            state;
        struct {
            uint32_t        non_inc      : 1;       /*  0 */
            uint32_t        pad1         : 1;       /*  1 */
            uint32_t        method       : 10;      /*  2 */
            uint32_t        pad2         : 1;       /* 12 */
            uint32_t        subchannel   : 3;       /* 13 */
            uint32_t        pad3         : 2;       /* 16 */
            uint32_t        method_count : 10;      /* 18 */
            uint32_t        pad4         : 1;       /* 28 */
            uint32_t        error        : 3;       /* 29 */
        } PACKED;
    } PACKED;
    uint32_t                param;
    void *                  next;
} PACKED nv2a_pfifo_cache;

static nv2a_pfifo_cache *   nv2a_cacheq = NULL;
static pthread_mutex_t      nv2a_cacheq_mutex = PTHREAD_MUTEX_INITIALIZER;
#define CACHEQ_LOCK         pthread_mutex_lock(&nv2a_cacheq_mutex)
#define CACHEQ_UNLOCK       pthread_mutex_unlock(&nv2a_cacheq_mutex)

typedef struct {
    uint32_t                handle;
    union {
        uint32_t            context;
        struct {
            uint32_t        instance : 16;          /*  0 */
            uint32_t        engine   : 2;           /* 16 */
#define NV_RAMHT_ENGINE_SW                              0
#define NV_RAMHT_ENGINE_GRAPHICS                        1
#define NV_RAMHT_ENGINE_DVD                             2
            uint32_t        pad1     : 6;           /* 18 */
            uint32_t        chid     : 5;           /* 24 */
            uint32_t        pad2     : 2;           /* 29 */
            uint32_t        valid    : 1;           /* 31 */
        } PACKED;
    } PACKED;
} PACKED nv2a_pfifo_ramht;

static pthread_mutex_t      nv2a_pgraph_fifo_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_pgraph_fifo_cond = PTHREAD_COND_INITIALIZER;
#define PGRAPH_FIFO_LOCK    pthread_mutex_lock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_UNLOCK  pthread_mutex_unlock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_WAIT    pthread_cond_wait(&nv2a_pgraph_fifo_cond, &nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_SIGNAL  pthread_cond_signal(&nv2a_pgraph_fifo_cond)
#define PGRAPH_FIFO_BROADCAST pthread_cond_broadcast(&nv2a_pgraph_fifo_cond)

static void
nv2a_pfifo_cache_enqueue(register const nv2a_pfifo_cache *c) {
    register nv2a_pfifo_cache **q;
    register size_t i;
    ENTER_NV2A;

    CACHEQ_LOCK;

    for (q = &nv2a_cacheq, i = 1; *q; q = (typeof(q))&(**q).next, ++i);

    *q = calloc(1, sizeof(*c));
    **q = *c;
    (**q).next = NULL;
