/*
 *  xexec - XBE x86 direct execution LLE & XBOX kernel POSIX translation HLE
 *
 *  Copyright (c) 2012 espes
 *  Copyright (c) 2015 Jannik Vogel
 *  Copyright (c) 2017 Michael Saga. All rights reserved.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License
 *  as published by the Free Software Foundation; either version 2
 *  of the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along
 *  with this program; if not, write to the Free Software Foundation, Inc.,
 *  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

#include "nv2a.h"

#define DEBUG_NV2A 2

#ifdef DEBUG_NV2A
# if DEBUG_NV2A == 1
#  define PRINT_NV2A        PRINT
# elif DEBUG_NV2A == 2
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# else
#  define ENTER_NV2A        ENTER
#  define LEAVE_NV2A        LEAVE
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# endif
#endif
#ifndef ENTER_NV2A
# define ENTER_NV2A
#endif
#ifndef LEAVE_NV2A
# define LEAVE_NV2A
#endif
#ifndef PRINT_NV2A
# define PRINT_NV2A(...)
#endif
#ifndef VARDUMP_NV2A
# define VARDUMP_NV2A(...)
#endif
#ifndef VARDUMP2_NV2A
# define VARDUMP2_NV2A(...)
#endif
#ifndef VARDUMP3_NV2A
# define VARDUMP3_NV2A(...)
#endif
#ifndef VARDUMP4_NV2A
# define VARDUMP4_NV2A(...)
#endif

typedef struct {
    union {
        uint32_t            flags;
        struct {
            uint32_t        class  : 12;            /*  0 */
            uint32_t        pad1   : 4;             /* 12 */
            uint32_t        target : 2;             /* 16 */
            uint32_t        pad2   : 2;             /* 18 */
            uint32_t        adjust : 12;            /* 20 */
        } PACKED;
    } PACKED;
    uint32_t                limit;
    uint32_t                frame;
} PACKED nv2a_dma;

#define NV2A_DMA(x) *(nv2a_dma *)(x)
#define NV2A_DMA_ADDRESS(x) ((((x)->frame & /* NV_DMA_ADDRESS */ 0xfffff000) | ((x)->adjust << 20)) & (host->memreg_size - 1))

typedef struct {
    int                     dirty;
    size_t                  ref;
    GLenum                  gl_target;
    GLuint                  gl_texture;
} nv2a_pgraph_texture;

typedef struct {
    glo_context *           glo;

    GLuint                  gl_framebuffer;

    GLuint                  gl_color_buffer;
    GLuint                  gl_zeta_buffer;

    GLuint                  gl_converted_buffer[NV2A_MAX_VERTEX_ATTRIBS];
    GLuint                  gl_inline_buffer[NV2A_MAX_VERTEX_ATTRIBS];
    GLuint                  gl_inline_array_buffer;
    GLuint                  gl_element_buffer;
//    GLuint                  gl_memory_buffer;

    GLuint                  gl_vertex_array;

    nv2a_pgraph_texture     texture[NV2A_MAX_TEXTURES];
} nv2a_context;

static nv2a_context *       nv2a_ctx = NULL;

typedef struct {
    union {
        uint32_t            state;
        struct {
            uint32_t        method       : 13;      /*  0 */
            uint32_t        subchannel   : 3;       /* 13 */
            uint32_t        non_inc      : 2;       /* 16 */
            uint32_t        method_count : 11;      /* 18 */
            uint32_t        error        : 3;       /* 29 */
        } PACKED;
    } PACKED;
    uint32_t                param;
    void *                  next;
} PACKED nv2a_pfifo_cache;

static nv2a_pfifo_cache *   nv2a_cacheq = NULL;
static pthread_mutex_t      nv2a_cacheq_mutex = PTHREAD_MUTEX_INITIALIZER;
#define CACHEQ_LOCK         pthread_mutex_lock(&nv2a_cacheq_mutex)
#define CACHEQ_UNLOCK       pthread_mutex_unlock(&nv2a_cacheq_mutex)

typedef struct {
    uint32_t                handle;
    union {
        uint32_t            context;
        struct {
            uint32_t        instance : 16;          /*  0 */
            uint32_t        engine   : 2;           /* 16 */
#define NV_RAMHT_ENGINE_SW       0
#define NV_RAMHT_ENGINE_GRAPHICS 1
#define NV_RAMHT_ENGINE_DVD      2
            uint32_t        pad1     : 6;           /* 18 */
            uint32_t        chid     : 5;           /* 24 */
            uint32_t        pad2     : 2;           /* 29 */
            uint32_t        valid    : 1;           /* 31 */
        } PACKED;
    } PACKED;
} PACKED nv2a_pfifo_ramht;

static pthread_mutex_t      nv2a_pgraph_fifo_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_pgraph_fifo_cond = PTHREAD_COND_INITIALIZER;
#define PGRAPH_FIFO_LOCK    pthread_mutex_lock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_UNLOCK  pthread_mutex_unlock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_WAIT    pthread_cond_wait(&nv2a_pgraph_fifo_cond, &nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_SIGNAL  PGRAPH_FIFO_LOCK, \
                            pthread_cond_broadcast(&nv2a_pgraph_fifo_cond), \
                            PGRAPH_FIFO_UNLOCK
static pthread_mutex_t      nv2a_pgraph_intr_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_pgraph_intr_cond = PTHREAD_COND_INITIALIZER;
#define PGRAPH_INTR_LOCK    pthread_mutex_lock(&nv2a_pgraph_intr_mutex)
#define PGRAPH_INTR_UNLOCK  pthread_mutex_unlock(&nv2a_pgraph_intr_mutex)
#define PGRAPH_INTR_WAIT    pthread_cond_wait(&nv2a_pgraph_intr_cond, &nv2a_pgraph_intr_mutex)
#define PGRAPH_INTR_SIGNAL  PGRAPH_INTR_LOCK, \
                            pthread_cond_broadcast(&nv2a_pgraph_intr_cond), \
                            PGRAPH_INTR_UNLOCK

static pthread_mutex_t      nv2a_flip_stall_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_flip_stall_cond = PTHREAD_COND_INITIALIZER;
#define FLIP_STALL_LOCK     pthread_mutex_lock(&nv2a_flip_stall_mutex)
#define FLIP_STALL_UNLOCK   pthread_mutex_unlock(&nv2a_flip_stall_mutex)
#define FLIP_STALL_WAIT     pthread_cond_wait(&nv2a_flip_stall_cond, &nv2a_flip_stall_mutex)
#define FLIP_STALL_SIGNAL   FLIP_STALL_LOCK, \
                            pthread_cond_broadcast(&nv2a_flip_stall_cond), \
                            FLIP_STALL_UNLOCK

static void
nv2a_pfifo_cache_enqueue(register const nv2a_pfifo_cache *c, register uint32_t param) {
    register nv2a_pfifo_cache **q;
    register size_t i;
    ENTER_NV2A;

    CACHEQ_LOCK;

    for (q = &nv2a_cacheq, i = 1; *q; q = (typeof(q))&(**q).next, ++i);

    *q = calloc(1, sizeof(*c));

    (**q).state = c->state;
    (**q).param = param;

//    PRINT_NV2A("%s: CACHEQ: %u command%s in queue", nv2a->name, i, (i != 1) ? "s" : "");

    CACHEQ_UNLOCK;

    LEAVE_NV2A;
}

static int
nv2a_pfifo_cache_dequeue(register nv2a_pfifo_cache *c) {
    register nv2a_pfifo_cache **q;
    register int ret = 0;
    ENTER_NV2A;

    CACHEQ_LOCK;

    q = &nv2a_cacheq;

    if (*q) {
        *c = **q;
        c->next = NULL;
        free(*q);
        *q = (**q).next;
        ret = 1;
    } else {
        PRINT_NV2A("%s: CACHEQ: no commands in queue", nv2a->name);
    }

    CACHEQ_UNLOCK;

    LEAVE_NV2A;
    return ret;
}

static int
nv2a_offset(register uint32_t *addr) {
    if ((*addr & 0xff000000) == nv2a->memreg_base) {
        *addr &= 0x00ffffff;
        return 0;
    }
    return 1;
}

static const nv2a_block *
nv2a_block_lookup(register uint32_t addr, register const char **reg) {
    register const nv2a_block *b;
    register size_t i;
    ENTER_NV2A;

    if (reg) *reg = NULL;

    for (i = 0; i <= ARRAY_SIZE(nv2a_blocks); ++i) {
        if (i >= ARRAY_SIZE(nv2a_blocks)) INT3;
        b = &nv2a_blocks[i];
        if (addr >= b->offset && addr < b->offset + b->size) {
            if (reg) {
                i = (addr - b->offset) / 4;
                switch (b->index) {
                case NV_PMC:
                    ARRAY(*reg, nv2a_pmc_name, i);
                    break;
                case NV_PBUS:
                    ARRAY(*reg, nv2a_pbus_name, i);
                    break;
                case NV_PVIDEO:
                    ARRAY(*reg, nv2a_pvideo_name, i);
                    break;
                case NV_PTIMER:
                    ARRAY(*reg, nv2a_ptimer_name, i);
                    break;
                case NV_PFB:
                    ARRAY(*reg, nv2a_pfb_name, i);
                    break;
                case NV_PGRAPH:
                    ARRAY(*reg, nv2a_pgraph_name, i);
                    break;
                case NV_PCRTC:
                    ARRAY(*reg, nv2a_pcrtc_name, i);
                    break;
                case NV_PRAMDAC:
                    ARRAY(*reg, nv2a_pramdac_name, i);
                    break;
                }
            }
            break;
        }
    }

    LEAVE_NV2A;
    return b;
}

#define NV2A_IRQ_BUSY   (1 << 0)
#define NV2A_IRQ_PGRAPH (1 << 1)
#define NV2A_IRQ_FIFO   (1 << 2)

#define NV2A_IRQ_WAIT(x,y,z) \
        x ## _ ## y ## _LOCK; \
        while (nv2a->irq_busy || NV2A_REG32_MASK_GET(nv2a->memreg, NV_ ## x, y, z)) { \
            if (nv2a->irq_busy) nv2a->irq_busy |= NV2A_IRQ_ ## x; \
            x ## _ ## y ## _WAIT; \
        } \
        x ## _ ## y ## _UNLOCK
#define NV2A_IRQ_WAITN(x,y,z) \
        x ## _ ## y ## _LOCK; \
        while (nv2a->irq_busy || !NV2A_REG32_MASK_GET(nv2a->memreg, NV_ ## x, y, z)) { \
            if (nv2a->irq_busy) nv2a->irq_busy |= NV2A_IRQ_ ## x; \
            x ## _ ## y ## _WAIT; \
        } \
        x ## _ ## y ## _UNLOCK

void
nv2a_irq_restore(register int mask) {
    if (!mask || !(mask & ~NV2A_IRQ_BUSY)) return;
    if (mask & NV2A_IRQ_PGRAPH) PGRAPH_INTR_SIGNAL;
    if (mask & NV2A_IRQ_FIFO) PGRAPH_FIFO_SIGNAL;
}

static void
nv2a_irq_raise(register int mask) {
    if (!mask) return;
    if (nv2a->irq_busy) {
        if (mask & NV2A_IRQ_PGRAPH) nv2a->irq_busy |= NV2A_IRQ_PGRAPH;
        if (mask & NV2A_IRQ_FIFO) nv2a->irq_busy |= NV2A_IRQ_FIFO;
    } else {
        nv2a_irq_restore(mask);
    }
}

int
nv2a_irq(void) {
    register const char *n;
    register void *p;
    register uint32_t enabled;
    register uint32_t pending;
    register int ret = 0;
    ENTER_NV2A;

    p = nv2a->memreg;

    if (!p ||
        !nv2a->irq_kinterrupt ||
        !nv2a->irq_connected ||
        !nv2a->irq_isr_routine) {
        LEAVE_NV2A;
        return ret;
    }

    n = nv2a->name;

    /* PFIFO */
    enabled = NV2A_REG32(p, NV_PFIFO, INTR_EN_0);
    pending = NV2A_REG32(p, NV_PFIFO, INTR_0);
    PRINT_NV2A("%s: IRQ: PFIFO: enabled 0x%.08x, pending 0x%.08x", n, enabled, pending);
    VARDUMP3_NV2A(DUMP, enabled, nv2a_pfifo_intr_name);
    VARDUMP3_NV2A(DUMP, pending, nv2a_pfifo_intr_name);
    if (pending & enabled) {
        PRINT_NV2A("%s: IRQ: PFIFO set", n);
        NV2A_REG32_MASK_SET(p, NV_PMC, INTR_0, PFIFO);
    } else {
        PRINT_NV2A("%s: IRQ: PFIFO unset", n);
        NV2A_REG32_MASK_UNSET(p, NV_PMC, INTR_0, PFIFO);
    }
    /* PCRTC */
    enabled = NV2A_REG32(p, NV_PCRTC, INTR_EN_0);
    pending = NV2A_REG32(p, NV_PCRTC, INTR_0);
    PRINT_NV2A("%s: IRQ: PCRTC: enabled 0x%.08x, pending 0x%.08x", n, enabled, pending);
    VARDUMP3_NV2A(DUMP, enabled, nv2a_pcrtc_intr_name);
    VARDUMP3_NV2A(DUMP, pending, nv2a_pcrtc_intr_name);
    if (pending & enabled) {
        PRINT_NV2A("%s: IRQ: PCRTC set", n);
        NV2A_REG32_MASK_SET(p, NV_PMC, INTR_0, PCRTC);
    } else {
        PRINT_NV2A("%s: IRQ: PCRTC unset", n);
        NV2A_REG32_MASK_UNSET(p, NV_PMC, INTR_0, PCRTC);
    }
    /* PGRAPH */
    enabled = NV2A_REG32(p, NV_PGRAPH, INTR_EN);
    pending = NV2A_REG32(p, NV_PGRAPH, INTR);
    PRINT_NV2A("%s: IRQ: PGRAPH: enabled 0x%.08x, pending 0x%.08x", n, enabled, pending);
    VARDUMP3_NV2A(DUMP, enabled, nv2a_pgraph_intr_name);
    VARDUMP3_NV2A(DUMP, pending, nv2a_pgraph_intr_name);
    if (pending & enabled) {
        PRINT_NV2A("%s: IRQ: PGRAPH set", n);
        NV2A_REG32_MASK_SET(p, NV_PMC, INTR_0, PGRAPH);
    } else {
        PRINT_NV2A("%s: IRQ: PGRAPH unset", n);
        NV2A_REG32_MASK_UNSET(p, NV_PMC, INTR_0, PGRAPH);
    }

    if (NV2A_REG32(p, NV_PMC, INTR_0) &&
        NV2A_REG32(p, NV_PMC, INTR_EN_0)) {
        PRINT_NV2A("%s: IRQ: raised!", n);
        nv2a->irq_level = 1;
        ret = 1;
    }

    LEAVE_NV2A;
    return ret;
}

static void
nv2a_pgraph_intr_context_switch(register void *p, register uint32_t chid) {
    ENTER_NV2A;

    if (//NV2A_REG32_MASK_GET(p, NV_PGRAPH, CTX_CONTROL, CHID_VALID) &&//TODO
        NV2A_REG32_MASK_BITSHIFT_GET(p, NV_PGRAPH, CTX_USER, CHID) == chid) {
        LEAVE_NV2A;
        return;
    }
INT3;//XXX
    NV2A_REG32_MASK_BITSHIFT_SET_VAL(p, NV_PGRAPH, TRAPPED_ADDR, CHID, chid);
    NV2A_REG32_MASK_SET(p, NV_PGRAPH, INTR, CONTEXT_SWITCH);

    IRQ_NV2A_SIGNAL;

    NV2A_IRQ_WAIT(PGRAPH, INTR, CONTEXT_SWITCH);

    LEAVE_NV2A;
}

static void
nv2a_pgraph_texture_bind(register void *p, size_t index) {
    ENTER_NV2A;

    if (index >= NV2A_MAX_TEXTURES) INT3;
#if 0
    uint32_t ctl_0        = pg->regs[NV_PGRAPH_TEXCTL0_0 + i*4];
//    uint32_t ctl_1        = pg->regs[NV_PGRAPH_TEXCTL1_0 + i*4];
    uint32_t fmt          = pg->regs[NV_PGRAPH_TEXFMT0 + i*4];
    uint32_t filter       = pg->regs[NV_PGRAPH_TEXFILTER0 + i*4];
    uint32_t address      = pg->regs[NV_PGRAPH_TEXADDRESS0 + i*4];
    uint32_t palette      = pg->regs[NV_PGRAPH_TEXPALETTE0 + i*4];

    uint32_t rect_width   = GET_MASK(pg->regs[NV_PGRAPH_TEXIMAGERECT0 + i*4], NV_PGRAPH_TEXIMAGERECT0_WIDTH);
    uint32_t rect_height  = GET_MASK(pg->regs[NV_PGRAPH_TEXIMAGERECT0 + i*4], NV_PGRAPH_TEXIMAGERECT0_HEIGHT);

    uint32_t border_color = pg->regs[NV_PGRAPH_BORDERCOLOR0 + i*4];
    uint32_t offset       = pg->regs[NV_PGRAPH_TEXOFFSET0 + i*4];
#endif
    register size_t pos = index * 64;
    register uint32_t addr;
    register uint32_t offset = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_OFFSET);      //0x00001b00,
    union {
        uint32_t     field;
        struct {
            uint32_t context_dma         : 2;   /*  0 */
            uint32_t cubemap_enable      : 1;   /*  2 */
            uint32_t border_source       : 1;   /*  3 */
            uint32_t dimensionality      : 4;   /*  4 */
            uint32_t color               : 8;   /*  8 */
            uint32_t mipmap_levels       : 4;   /* 16 */
            uint32_t base_size_u         : 4;   /* 20 */
            uint32_t base_size_v         : 4;   /* 24 */
            uint32_t base_size_p         : 4;   /* 28 */
        } PACKED;
    } PACKED format     = { .field = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_FORMAT) };//0x00001b04
    uint32_t address    = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_ADDRESS);     //0x00001b08,
    union {
        uint32_t     field;
        struct {
            uint32_t color_key_operation : 2;   /*  0 */
            uint32_t alpha_kill_enable   : 1;   /*  2 */
            uint32_t image_field_enable  : 1;   /*  3 */
            uint32_t log_max_aniso       : 2;   /*  4 */
            uint32_t max_lod_clamp       : 12;  /*  6 */
            uint32_t min_lod_clamp       : 12;  /* 18 */
            uint32_t enable              : 2;   /* 30 */
        } PACKED;
    } PACKED ctl0       = { .field = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_CONTROL0) };//0x00001b0c
    uint32_t pitch      = NV2A_REG32_MASK_BITSHIFT_GET(p + pos, NV_097, SET_TEXTURE_CONTROL1, IMAGE_PITCH);//0x00001b10,
    union {
        uint32_t     field;
        struct {
            uint32_t mipmap_lod_bias     : 13;  /*  0 */
            uint32_t convolution_kernel  : 3;   /* 13 */
            uint32_t min                 : 8;   /* 16 */
            uint32_t mag                 : 4;   /* 24 */
            uint32_t asigned_enabled     : 1;   /* 28 */
            uint32_t rsigned_enabled     : 1;   /* 29 */
            uint32_t gsigned_enabled     : 1;   /* 30 */
            uint32_t bsigned_enabled     : 1;   /* 31 */
        } PACKED;
    } PACKED filter     = { .field = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_FILTER) };//0x00001b14
    uint32_t width      = NV2A_REG32_MASK_BITSHIFT_GET(p + pos, NV_097, SET_TEXTURE_IMAGE_RECT, WIDTH);//0x00001b1c
    uint32_t height     = NV2A_REG32_MASK_BITSHIFT_GET(p + pos, NV_097, SET_TEXTURE_IMAGE_RECT, HEIGHT);//0x00001b1c
    uint32_t depth;
    union {
        uint32_t     field;
        struct {
            uint32_t context_dma         : 2;   /*  0 */
            uint32_t length              : 4;   /*  2 */
            uint32_t offset              : 26;  /*  6 */
        } PACKED;
    } PACKED palette    = { .field = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_PALETTE) };//0x00001b20
    uint32_t bcolor     = NV2A_REG32(p + pos, NV_097, SET_TEXTURE_BORDER_COLOR);//0x00001b24,
    uint32_t plength, mlevel, bsizeu, bsizev, bsizep, maxlod;
    nv2a_pgraph_texture *t;
