/*
 *  xexec - XBE x86 direct execution LLE & XBOX kernel POSIX translation HLE
 *
 *  Copyright (c) 2012 espes
 *  Copyright (c) 2015 Jannik Vogel
 *  Copyright (c) 2017 Michael Saga. All rights reserved.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License
 *  as published by the Free Software Foundation; either version 2
 *  of the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along
 *  with this program; if not, write to the Free Software Foundation, Inc.,
 *  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

#include "nv2a.h"

#include "swizzle.c" //TODO move to a makefile

#define DEBUG_NV2A 2

#ifdef DEBUG_NV2A
# if DEBUG_NV2A == 1
#  define PRINT_NV2A        PRINT
# elif DEBUG_NV2A == 2
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# else
#  define ENTER_NV2A        ENTER
#  define LEAVE_NV2A        LEAVE
#  define PRINT_NV2A        PRINT
#  define VARDUMP_NV2A      VARDUMP
#  define VARDUMP2_NV2A     VARDUMP2
#  define VARDUMP3_NV2A     VARDUMP3
#  define VARDUMP4_NV2A     VARDUMP4
# endif
#endif
#ifndef ENTER_NV2A
# define ENTER_NV2A
#endif
#ifndef LEAVE_NV2A
# define LEAVE_NV2A
#endif
#ifndef PRINT_NV2A
# define PRINT_NV2A(...)
#endif
#ifndef VARDUMP_NV2A
# define VARDUMP_NV2A(...)
#endif
#ifndef VARDUMP2_NV2A
# define VARDUMP2_NV2A(...)
#endif
#ifndef VARDUMP3_NV2A
# define VARDUMP3_NV2A(...)
#endif
#ifndef VARDUMP4_NV2A
# define VARDUMP4_NV2A(...)
#endif

typedef struct {
    union {
        uint32_t            flags;
        struct {
            uint32_t        class  : 12;            /*  0 */
            uint32_t        pad1   : 4;             /* 12 */
            uint32_t        target : 2;             /* 16 */
            uint32_t        pad2   : 2;             /* 18 */
            uint32_t        adjust : 12;            /* 20 */
        } PACKED;
    } PACKED;
    uint32_t                limit;
    uint32_t                frame;
} PACKED nv2a_dma;

#define NV2A_DMA(x) *(nv2a_dma *)(x)
#define NV2A_DMA_ADDRESS(x) ((((x)->frame & /* NV_DMA_ADDRESS */ 0xfffff000) | ((x)->adjust << 20)) & (host->memreg_size - 1))

typedef struct {
    GLuint                          gl_texture;
    GLenum                          gl_target;
    int                             ref;
} nv2a_pgraph_texture_binding;

typedef struct {
    size_t                          index;
    int                             dirty;
    nv2a_pgraph_texture_binding *   binding;
    uint32_t                        offset;
    void *                          ctx;
    size_t                          length;
    uint32_t                        poffset;
    void *                          pctx;
    size_t                          plength;
    union {
        uint32_t     field;
        struct {
            uint32_t context_dma         : 2;       /*  0 */
            uint32_t cubemap             : 1;       /*  2 */
            uint32_t border_source       : 1;       /*  3 */
            uint32_t dimensionality      : 4;       /*  4 */
            uint32_t color               : 8;       /*  8 */
            uint32_t mipmap_levels       : 4;       /* 16 */
            uint32_t base_size_u         : 4;       /* 20 */
            uint32_t base_size_v         : 4;       /* 24 */
            uint32_t base_size_p         : 4;       /* 28 */
        } PACKED;
    } PACKED                        format;
    union {
        uint32_t     field;
        struct {
            uint32_t u                   : 4;       /*  0 */
            uint32_t cylwrap_u           : 4;       /*  4 */
            uint32_t v                   : 4;       /*  8 */
            uint32_t cylwrap_v           : 4;       /* 12 */
            uint32_t p                   : 4;       /* 16 */
            uint32_t cylwrap_p           : 4;       /* 20 */
            uint32_t cylwrap_q           : 8;       /* 24 */
        } PACKED;
    } PACKED                        address;
    union {
        uint32_t     field;
        struct {
            uint32_t color_key_operation : 2;       /*  0 */
            uint32_t alpha_kill_enable   : 1;       /*  2 */
            uint32_t image_field_enable  : 1;       /*  3 */
            uint32_t log_max_aniso       : 2;       /*  4 */
            uint32_t max_lod_clamp       : 12;      /*  6 */
            uint32_t min_lod_clamp       : 12;      /* 18 */
            uint32_t enable              : 2;       /* 30 */
        } PACKED;
    } PACKED                        ctl0;
    uint32_t                        pitch;
    union {
        uint32_t     field;
        struct {
            uint32_t mipmap_lod_bias     : 13;      /*  0 */
            uint32_t convolution_kernel  : 3;       /* 13 */
            uint32_t min                 : 8;       /* 16 */
            uint32_t mag                 : 4;       /* 24 */
            uint32_t asigned_enabled     : 1;       /* 28 */
            uint32_t rsigned_enabled     : 1;       /* 29 */
            uint32_t gsigned_enabled     : 1;       /* 30 */
            uint32_t bsigned_enabled     : 1;       /* 31 */
        } PACKED;
    } PACKED                        filter;
    uint32_t                        width;
    uint32_t                        height;
    uint32_t                        depth;
    union {
        uint32_t     field;
        struct {
            uint32_t context_dma         : 2;       /*  0 */
            uint32_t length              : 4;       /*  2 */
            uint32_t offset              : 26;      /*  6 */
        } PACKED;
    } PACKED                        palette;
    nv2a_color_bgra                 bcolor;
    uint32_t                        mlevels;
} nv2a_pgraph_texture;

static const GLenum nv2a_pgraph_texture_filter_min_map[] = {
    0,
    GL_NEAREST,
    GL_LINEAR,
    GL_NEAREST_MIPMAP_NEAREST,
    GL_LINEAR_MIPMAP_NEAREST,
    GL_NEAREST_MIPMAP_LINEAR,
    GL_LINEAR_MIPMAP_LINEAR,
    GL_LINEAR, /* TODO: Convolution filter... */
};

static const GLenum nv2a_pgraph_texture_filter_mag_map[] = {
    0,
    GL_NEAREST,
    GL_LINEAR,
    0,
    GL_LINEAR, /* TODO: Convolution filter... */
};

static const GLenum nv2a_pgraph_texture_wrap_map[] = {
    0,
    GL_REPEAT,
    GL_MIRRORED_REPEAT,
    GL_CLAMP_TO_EDGE,
    GL_CLAMP_TO_BORDER,
//    GL_CLAMP,
};

typedef struct {
    glo_context *           glo;

    GLuint                  gl_framebuffer;

    GLuint                  gl_color_buffer;
    GLuint                  gl_zeta_buffer;

    GLuint                  gl_converted_buffer[NV2A_MAX_VERTEX_ATTRIBS];
    GLuint                  gl_inline_buffer[NV2A_MAX_VERTEX_ATTRIBS];
    GLuint                  gl_inline_array_buffer;
    GLuint                  gl_element_buffer;
//    GLuint                  gl_memory_buffer;

    GLuint                  gl_vertex_array;

    nv2a_pgraph_texture     texture[NV2A_MAX_TEXTURES];
} nv2a_context;

static nv2a_context *       nv2a_ctx = NULL;

typedef struct {
    union {
        uint32_t            state;
        struct {
            uint32_t        method       : 13;      /*  0 */
            uint32_t        subchannel   : 3;       /* 13 */
            uint32_t        non_inc      : 2;       /* 16 */
            uint32_t        method_count : 11;      /* 18 */
            uint32_t        error        : 3;       /* 29 */
        } PACKED;
    } PACKED;
    uint32_t                param;
    void *                  next;
} PACKED nv2a_pfifo_cache;

static nv2a_pfifo_cache *   nv2a_cacheq = NULL;
static pthread_mutex_t      nv2a_cacheq_mutex = PTHREAD_MUTEX_INITIALIZER;
#define CACHEQ_LOCK         pthread_mutex_lock(&nv2a_cacheq_mutex)
#define CACHEQ_UNLOCK       pthread_mutex_unlock(&nv2a_cacheq_mutex)

typedef struct {
    uint32_t                handle;
    union {
        uint32_t            context;
        struct {
            uint32_t        instance : 16;          /*  0 */
            uint32_t        engine   : 2;           /* 16 */
#define NV_RAMHT_ENGINE_SW       0
#define NV_RAMHT_ENGINE_GRAPHICS 1
#define NV_RAMHT_ENGINE_DVD      2
            uint32_t        pad1     : 6;           /* 18 */
            uint32_t        chid     : 5;           /* 24 */
            uint32_t        pad2     : 2;           /* 29 */
            uint32_t        valid    : 1;           /* 31 */
        } PACKED;
    } PACKED;
} PACKED nv2a_pfifo_ramht;

static pthread_mutex_t      nv2a_pgraph_fifo_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_pgraph_fifo_cond = PTHREAD_COND_INITIALIZER;
#define PGRAPH_FIFO_LOCK    pthread_mutex_lock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_UNLOCK  pthread_mutex_unlock(&nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_WAIT    pthread_cond_wait(&nv2a_pgraph_fifo_cond, &nv2a_pgraph_fifo_mutex)
#define PGRAPH_FIFO_SIGNAL  PGRAPH_FIFO_LOCK, \
                            pthread_cond_broadcast(&nv2a_pgraph_fifo_cond), \
                            PGRAPH_FIFO_UNLOCK
static pthread_mutex_t      nv2a_pgraph_intr_mutex = PTHREAD_MUTEX_INITIALIZER;
static pthread_cond_t       nv2a_pgraph_intr_cond = PTHREAD_COND_INITIALIZER;
#define PGRAPH_INTR_LOCK    pthread_mutex_lock(&nv2a_pgraph_intr_mutex)
#define PGRAPH_INTR_UNLOCK  pthread_mutex_unlock(&nv2a_pgraph_intr_mutex)
