
enum {
        NV_PGRAPH_DEBUG_0                           = 0x00000080,
#define NV_PGRAPH_DEBUG_0_STATE                                                 0x00000001
#define NV_PGRAPH_DEBUG_0_STATE__BITSHIFT                                       0
#define NV_PGRAPH_DEBUG_0_STATE_NORMAL                                          0
#define NV_PGRAPH_DEBUG_0_STATE_RESET                                           1
#define NV_PGRAPH_DEBUG_0_FE_2D_STATE                                           0x00000002
#define NV_PGRAPH_DEBUG_0_FE_2D_STATE__BITSHIFT                                 1
#define NV_PGRAPH_DEBUG_0_FE_2D_STATE_NORMAL                                    0
#define NV_PGRAPH_DEBUG_0_FE_2D_STATE_RESET                                     1
#define NV_PGRAPH_DEBUG_0_FE_3D_STATE                                           0x00000004
#define NV_PGRAPH_DEBUG_0_FE_3D_STATE__BITSHIFT                                 2
#define NV_PGRAPH_DEBUG_0_FE_3D_STATE_NORMAL                                    0
#define NV_PGRAPH_DEBUG_0_FE_3D_STATE_RESET                                     1
#define NV_PGRAPH_DEBUG_0_CACHE_STATE                                           0x00000008
#define NV_PGRAPH_DEBUG_0_CACHE_STATE__BITSHIFT                                 3
#define NV_PGRAPH_DEBUG_0_CACHE_STATE_NORMAL                                    0
#define NV_PGRAPH_DEBUG_0_CACHE_STATE_RESET                                     1

#define NV_PGRAPH_DMA_B_XLATE_INST_VALUE__BITSHIFT                              0
        NV_PGRAPH_DMA_B_CONTROL                     = 0x00001084,
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_TABLE                                      0x00001000
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_TABLE__BITSHIFT                            12
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_TABLE_NOT_PRESENT                          0
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_TABLE_PRESENT                              1
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_ENTRY                                      0x00002000
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_ENTRY__BITSHIFT                            13
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_ENTRY_NOT_LINEAR                           0
#define NV_PGRAPH_DMA_B_CONTROL_PAGE_ENTRY_LINEAR                               1
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE                                     0x00030000
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE__BITSHIFT                           16
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE_NVM                                 0
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE_NVM_TILED                           1
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE_PCI                                 2
#define NV_PGRAPH_DMA_B_CONTROL_TARGET_NODE_AGP                                 3
#define NV_PGRAPH_DMA_B_CONTROL_ADJUST                                          0xfff00000
#define NV_PGRAPH_DMA_B_CONTROL_ADJUST__BITSHIFT                                20
        NV_PGRAPH_DMA_B_LIMIT                       = 0x00001088,
        NV_PGRAPH_DMA_B_TLB_PTE                     = 0x0000108c,
#define NV_PGRAPH_DMA_B_TLB_PTE_ACCESS                                          0x00000002
#define NV_PGRAPH_DMA_B_TLB_PTE_ACCESS__BITSHIFT                                1
#define NV_PGRAPH_DMA_B_TLB_PTE_ACCESS_READ_ONLY                                0
#define NV_PGRAPH_DMA_B_TLB_PTE_ACCESS_READ_WRITE                               1
#define NV_PGRAPH_DMA_B_TLB_PTE_FRAME_ADDRESS                                   0xfffff000
#define NV_PGRAPH_DMA_B_TLB_PTE_FRAME_ADDRESS__BITSHIFT                         12
        NV_PGRAPH_DMA_B_TLB_TAG                     = 0x00001090,
#define NV_PGRAPH_DMA_B_TLB_TAG_ADDRESS                                         0xfffff000
#define NV_PGRAPH_DMA_B_TLB_TAG_ADDRESS__BITSHIFT                               12
        NV_PGRAPH_DMA_B_ADJ_OFFSET                  = 0x00001094,
        NV_PGRAPH_DMA_B_OFFSET                      = 0x00001098,
        NV_PGRAPH_DMA_B_SIZE                        = 0x0000109c,
#define NV_PGRAPH_DMA_B_SIZE_VALUE                                              0x01ffffff
#define NV_PGRAPH_DMA_B_SIZE_VALUE__BITSHIFT                                    0
        NV_PGRAPH_DMA_B_Y_SIZE                      = 0x000010a0,
#define NV_PGRAPH_DMA_B_Y_SIZE_VALUE                                            0x000007ff
#define NV_PGRAPH_DMA_B_Y_SIZE_VALUE__BITSHIFT                                  0
};

typedef union {
    uint32_t     field;
    struct {
        uint32_t grclass          : 8;  /*  0 */
        uint32_t pad1             : 4;  /*  8 */
        uint32_t chroma_key       : 1;  /* 12 */    /* enable flag */
        uint32_t user_clip        : 1;  /* 13 */    /* enable flag */
        uint32_t swizzle          : 1;  /* 14 */    /* enable flag */
        uint32_t patch_config     : 3;  /* 15 */
        uint32_t synchronize      : 1;  /* 18 */    /* enable flag */
        uint32_t endian_mode      : 1;  /* 19 */    /* big endian flag */
        uint32_t dither_mode      : 2;  /* 20 */
        uint32_t class_type       : 1;  /* 22 */
        uint32_t single_step      : 1;  /* 23 */    /* enable flag */
        uint32_t patch_status     : 1;  /* 24 */    /* valid flag */
        uint32_t context_surface0 : 1;  /* 25 */    /* valid flag */
        uint32_t context_surface1 : 1;  /* 26 */    /* valid flag */
        uint32_t context_pattern  : 1;  /* 27 */    /* valid flag */
        uint32_t context_rop      : 1;  /* 28 */    /* valid flag */
        uint32_t context_beta1    : 1;  /* 29 */    /* valid flag */
        uint32_t context_beta4    : 1;  /* 30 */    /* valid flag */
        uint32_t volatile_reset   : 1;  /* 31 */    /* enable flag */
    } PACKED;
} PACKED nv2a_pgraph_ctx1;

typedef union {
    uint32_t     field;
    struct {
        uint32_t mono_format      : 2;  /*  0 */
        uint32_t pad1             : 6;  /*  2 */
        uint32_t color_format     : 6;  /*  8 */
        uint32_t pad2             : 2;  /* 14 */
        uint32_t notify_instance  : 16; /* 16 */
    } PACKED;
} PACKED nv2a_pgraph_ctx2;

typedef union {
    uint32_t     field;
    struct {
        uint32_t dma_instance0    : 16; /*  0 */
        uint32_t dma_instance1    : 16; /* 16 */
    } PACKED;
} PACKED nv2a_pgraph_ctx3;

typedef union {
    uint32_t     field;
    struct {
        uint32_t user_instance    : 16; /*  0 */
        uint32_t pad1             : 16; /* 16 */
    } PACKED;
} PACKED nv2a_pgraph_ctx4;

typedef union {
    uint32_t     field;
    struct {
        uint32_t trap_bits;             /*  0 */
    } PACKED;
} PACKED nv2a_pgraph_ctx5;

typedef struct {
    nv2a_pgraph_ctx1 *ctx1;
    nv2a_pgraph_ctx2 *ctx2;
    nv2a_pgraph_ctx3 *ctx3;
    nv2a_pgraph_ctx4 *ctx4;
    nv2a_pgraph_ctx5 *ctx5;
} nv2a_pgraph_ctx;

static const char *const nv2a_pgraph_intr_name[] = {
    NAMEB(0,  notify),
    NAMEB(4,  missing_hw),
    NAMEB(6,  tlb_present_dma_r),
    NAMEB(7,  tlb_present_dma_w),
    NAMEB(8,  tlb_present_tex_a),
    NAMEB(9,  tlb_present_tex_b),
    NAMEB(10, tlb_present_vtx),
    NAMEB(12, context_switch),
    NAMEB(13, state3d),
    NAMEB(16, buffer_notify),
    NAMEB(20, error),
    NAMEB(24, single_step),
};

static const char *const nv2a_pgraph_name[] = {
    NAMER(NV_PGRAPH_DEBUG_0),
    NAMER(NV_PGRAPH_DEBUG_1),
    NAMER(NV_PGRAPH_DEBUG_2),
    NAMER(NV_PGRAPH_DEBUG_3),
