/*
 *  xexec - XBE x86 direct execution LLE & XBOX kernel POSIX translation HLE
 *
 *  Copyright (c) 2017-2019 Michael Saga
 *  All rights reserved.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License
 *  as published by the Free Software Foundation; either version 2
 *  of the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License along
 *  with this program; if not, write to the Free Software Foundation, Inc.,
 *  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

/* same as in ucontext.h */
enum {
    X86_GS = 0,
    X86_FS,
    X86_ES,
    X86_DS,
    X86_EDI,
    X86_ESI,
    X86_EBP,
    X86_ESP,
    X86_EBX,
    X86_EDX,
    X86_ECX,
    X86_EAX,
    X86_TRAPNO,
    X86_ERR,
    X86_EIP,
    X86_CS,
    X86_EFL,
    X86_UESP,
    X86_SS,
    X86_MAX
};

static const char *const x86_greg_name[] = {
    [X86_GS]     = " gs",
    [X86_FS]     = " fs",
    [X86_ES]     = " es",
    [X86_DS]     = " ds",
    [X86_EDI]    = "edi",
    [X86_ESI]    = "esi",
    [X86_EBP]    = "ebp",
    [X86_ESP]    = "esp",
    [X86_EBX]    = "ebx",
    [X86_EDX]    = "edx",
    [X86_ECX]    = "ecx",
    [X86_EAX]    = "eax",
    [X86_TRAPNO] = "tno",
    [X86_ERR]    = "err",
    [X86_EIP]    = "eip",
    [X86_CS]     = " cs",
    [X86_EFL]    = "efl",
    [X86_UESP]   = "esp",
    [X86_SS]     = " ss",
};

typedef struct {
    uint32_t cf   : 1;  /*  0 - carry flag */
    uint32_t r1   : 1;  /*  1 - reserved */
    uint32_t pf   : 1;  /*  2 - parity flag */
    uint32_t r2   : 1;  /*  3 - reserved */
    uint32_t af   : 1;  /*  4 - adjust flag */
    uint32_t r3   : 1;  /*  5 - reserved */
    uint32_t zf   : 1;  /*  6 - zero flag */
    uint32_t sf   : 1;  /*  7 - sign flag */
    uint32_t tf   : 1;  /*  8 - trap flag */
    uint32_t ief  : 1;  /*  9 - interrupt enable flag */
    uint32_t df   : 1;  /* 10 - direction flag */
    uint32_t of   : 1;  /* 11 - overflow flag */
    uint32_t iopl : 2;  /* 12 - i/o privilege level */
    uint32_t nt   : 1;  /* 14 - nested task flag */
    uint32_t r4   : 1;  /* 15 - reserved */
    uint32_t rf   : 1;  /* 16 - resume flag */
    uint32_t vm   : 1;  /* 17 - virtual 8086 mode flag */
    uint32_t ac   : 1;  /* 18 - alignment check flag */
    uint32_t vif  : 1;  /* 19 - virtual interrupt flag */
    uint32_t vip  : 1;  /* 20 - virtual interrupt pending flag */
    uint32_t id   : 1;  /* 21 - cpuid instruction permission flag */
    uint32_t r5   : 10; /* 22 - reserved */
} x86_eflags;

static const char *const x86_eflags_name[] = {
    NAMEB(0,  carry),
    NAMEB(2,  parity),
    NAMEB(4,  adjust),
    NAMEB(6,  zero),
    NAMEB(7,  sign),
    NAMEB(8,  trap),
    NAMEB(9,  irq_enable),
    NAMEB(10, direction),
    NAMEB(11, overflow),
    NAMEB(14, nested),
    NAMEB(16, resume),
    NAMEB(17, vm86),
    NAMEB(18, align),
    NAMEB(19, virq),
    NAMEB(20, virq_pending),
    NAMEB(21, cpuid),
};
#if 0
typedef struct {
    //TODO
} x86_context;

void
x86_push_callback(ucontext_t *uc) {

}
#endif
int
x86_iterate(ucontext_t *uc, int si_code) {
    register void **bp;
    register void **ip = (void **)&uc->uc_mcontext.gregs[X86_EIP];
    register x86_eflags *fl = (void *)&uc->uc_mcontext.gregs[X86_EFL];
    int prefix = 0;
    uint32_t sz = 4;
    uint32_t i;
    uint32_t v;
    register int ret = 0;

    switch (si_code) {
    case 0:
    case SEGV_MAPERR /* 1 */:
    case SEGV_ACCERR /* 2 */:
